# shop_data.py

SHOP_DATA = {
    "vip": {
        "title": "🏅مولتی لوکیشن VIP 🏅",
        "months": {
            "1": {"title": "یک ماهه", "packages": [("5 گیگ", 40000), ("10 گیگ", 75000), ("20 گیگ", 140000), ("30 گیگ", 210000), ("40 گیگ", 260000), ("50 گیگ", 300000), ("100 گیگ", 550000), ("200 گیگ", 1000000)]},
            "2": {"title": "دو ماهه", "packages": [("50 گیگ", 340000), ("100 گیگ", 590000), ("200 گیگ", 1040000)]}
        }
    },
    "eco": {
        "title": "🥈مولتی لوکیشن اقتصادی🥈",
        "months": {
            "1": {"title": "یک ماهه", "packages": [("10 گیگ", 50000), ("20 گیگ", 100000), ("30 گیگ", 140000), ("40 گیگ", 180000), ("50 گیگ", 210000), ("100 گیگ", 400000), ("200 گیگ", 780000)]}
        }
    },
    "unlim": {
        "title": "♾️مولتی لوکیشن نامحدود♾️",
        "months": {
            "1": {"title": "یک ماهه", "packages": [("200 گیگ (تک کاربر)", 150000), ("500 گیگ (تک کاربر)", 300000)]}
        }
    },
    "ger": {
        "title": "🇩🇪آیپی ثابت آلمان🇩🇪",
        "months": {
            "1": {"title": "یک ماهه", "packages": [("5 گیگ", 50000), ("10 گیگ", 90000), ("20 گیگ", 160000), ("30 گیگ", 240000), ("40 گیگ", 300000), ("50 گیگ", 350000), ("100 گیگ", 350000), ("200 گیگ", 1200000)]},
            "2": {"title": "دو ماهه", "packages": [("50 گیگ", 390000), ("100 گیگ", 690000), ("200 گیگ", 1240000)]}
        }
    },
    "usa": {
        "title": 🇩🇪آیپی ثابت آلمان (پیشنهادی)🇩🇪 (پیشنهادی)",
        "months": {
            "1": {"title": "یک ماهه", "packages": [("25 گیگ", 150000), ("50 گیگ", 200000), ("100 گیگ", 300000), ("150 گیگ", 350000), ("200 گیگ", 400000)]},
            "2": {"title": "دو ماهه", "packages": [("25 گیگ", 160000), ("50 گیگ", 210000), ("100 گیگ", 310000), ("150 گیگ", 360000), ("200 گیگ", 410000)]},
            "3": {"title": "سه ماهه", "packages": [("25 گیگ", 170000), ("50 گیگ", 220000), ("100 گیگ", 320000), ("150 گیگ", 370000), ("200 گیگ", 420000)]},
            "4": {"title": "نامحدود", "packages": [("نامحدود - ماهانه - تک کاربره", 300000), ("نامحدود - ماهانه - دو کاربره", 380000)]}
        }
    }
}
